app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "session_token", "created_at", "updated_at", "location", "interests", "experience") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "JJKbJzpBrzrL4paO4KsrfA"], ["updated_at", "2020-04-28 23:23:15.196163"], ["id", 1]]
---
    def create
        @user = User.create(user_params)
        if @user.save